//模板
#include <stdio.h>

int main() {
//---------------------------反转字符串-----------------------------------------
	char c[100], d[100];
	scanf("%s", c);
	int length = strlen(c);
	int i, j;
	int temp;
	// 反转
	for (i = 0, j = length - 1; i < j; i++, j--) {
		temp = c[i];
		c[i] = c[j];
		c[j] = temp;
	}
	// 复制到d
	strcpy(d, c);
	printf("%s", d);
//---------------------------反转字符串-----------------------------------------
//---------------------------判断回文数-----------------------------------------
	int a;
	int rev;
	scanf("%d", &a);
	int b = a;
	while (a != 0) {
		//每次取出原数的最后一位数字并加入到 rev 中
		//，接着将原数除以 10 并继续进行循环，直到原数变成 0 为止。
		rev = rev * 10 + a % 10;
		a /= 10;
		printf("a is %d, rev is %d\n", a, rev);
	}
	if (rev == b) {
		printf("yes");
	} else {
		printf("no");
	}
//---------------------------判断回文数-----------------------------------------
}
